package ch6;

/**
 * 
 * ################# 본격적인 OOP ###########################
 * 
 * - 생성자
 *   인스턴스가 생성될 때 호출되는 '인스턴스 초기화 메소드'임.
 *   인스턴스의 초기화 작업에 주로 사용됨.
 *   인스턴스 생성 시 실행되어야 할 작업을 위해서도 사용됨.
 *   
 *   특징 : 구조가 메소드와 유사. 반환값이 없음.( void 사용하지 않음. ) 
 *   
 *   작성 : 생성자의 이름이 클래스 이름과 동일해야 함.
 *   
 *   생성자를 통한 인스턴스 생성.
 *   MyMath mm = new MyMath();  // 현재의 생성자는 코드에 없음.
 *   							// 컴파일러가 기본적으로 제공.
 *   
 *   1. 연산
 * 
 */

public class OopEx2 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
